# LAB 03 - Data preprocessing

## 02 데이터 구조 점검

### #01.준비작업

In [2]:
#패키지 참조
from hossam import load_data
from pandas import Series

In [4]:
#데이터 가져오기
origin = load_data('grade')
origin

[data] https://data.hossam.kr/data/common/grade.xlsx
[desc] 어느 학급의 과목별 점수를 조사한 가상의 데이터

field    description
-------  -------------
이름     index
학년     int
성별     str
국어     int
영어     int
수학     int
과학     int

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80

### #02. 행/열 재배치
- 열 순서를 변경할 떄는 reindex 메서드에서 columns 파라미터 전달
- 원본에 변화 없고 결과가 반영된 복사본이 생성된다
- 재배치 되지 않은 열은 제외되기 떄문에 불필요한 컬럼을 제거하는 역할도 할수 있다

In [7]:
열순서변경df=origin.reindex(columns=['국어','수학','과학','영어'])

열순서변경df

    국어  수학  과학   영어
이름
철수  98  88  64   77
영희  88  62  72  120
민철  92  83  79   70
수현  63  31  71   60
호영  75  90  88   50
영호  80  91  72   88
용식  82  79  90   88
나영  90  81  95   92
석영  91  89  80   90

- 행순서를 변경할 떄는 reindex 메서드에서 index 파라미터 전달

In [9]:
행순서변경df = origin.reindex(index=['석영','호영','민철','수현'])
행순서변경df

    학년  성별  국어  영어  수학  과학
이름
석영   1  남자  91  90  89  80
호영   4  남자  75  50  90  88
민철   1  남자  92  70  83  79
수현   3  여자  63  60  31  71

### #03.행/열 추가

<행 추가>
*데이터 프레임에서 행 접근은 a.loc[]
- 리스트로 추가하기 : 기존의 컬럼 순서대로 넣어야하고, 누락되는 값이 있거나 초과할 경우 에러
- 딕셔너리로 추가하기 :컬럼 순서 상관없이 넣을 수 있지만, 누락되는 값이 있거나 초과할 경우는 에러
- Series 객체로 추가하기 : 컬럼 순서 상관 없지만, Series 객체의 index 가 datagrame 의 변수명과 동일해야함
- 빈 값을 저장하는 경우 : 데이터를 추가할 떄, 값이 없는 필드는 생략할 수 있고, Series 형태로 객체를 추가할 때만 가능함
- 기존의 행을 복사해서 넣는 경우
- 단일 값 추가하기

In [11]:
#행 추가하기 - 리스트로 추가하기
리스트_행추가df = origin.copy()
리스트_행추가df.loc['정호'] = [2,'남자',90,80,70,60] 
리스트_행추가df

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80
정호   2  남자  90   80  70  60

In [13]:
#행 추가하기 - 딕셔너리로 추가하기
# 원본 복사
딕셔너리_행추가df = origin.copy()

# 새 행 추가 (index = '민정') > 컬럼의 순서는 상관이 없는 것 확인
딕셔너리_행추가df.loc['민정'] = {
    '성별': '여자',
    '학년': 4,
    '국어': 81,
    '영어': 72,
    '수학': 84,
    '과학': 90
}

# 결과 출력
딕셔너리_행추가df

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80
민정   4  여자  81   72  84  90

In [15]:
#행 추가하기 - Series 객체로 추가하기

시리즈_행추가df = origin.copy()
s=Series([2,'남자',90,80,70,60],index=['학년','성별','국어','영어','수학','과학'])

시리즈_행추가df.loc['형석']=s
시리즈_행추가df

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80
형석   2  남자  90   80  70  60

In [17]:
#행 추가하기 - 빈 값을 저장해야 하는 경우
빈값_행추가df = origin.copy()
s=Series([2,'남자',93,71],index =['학년','성별','국어','수학'])   #데이터를 추가할 떄 값이 없는 필드를 생략하면 NaN 값으로 들어간다

빈값_행추가df.loc['석호']=s    
빈값_행추가df

    학년  성별  국어     영어  수학    과학
이름
철수   1  남자  98   77.0  88  64.0
영희   2  여자  88  120.0  62  72.0
민철   1  남자  92   70.0  83  79.0
수현   3  여자  63   60.0  31  71.0
호영   4  남자  75   50.0  90  88.0
영호   4  남자  80   88.0  91  72.0
용식   2  남자  82   88.0  79  90.0
나영   1  여자  90   92.0  81  95.0
석영   1  남자  91   90.0  89  80.0
석호   2  남자  93    NaN  71   NaN

In [19]:
#행 추가하기 - 기존의 행을 복사해서 추가하는 경우

행_복사df = origin.copy()
행_복사df.loc['철민']=행_복사df.loc['철수']  #새로운 행을 생성해서 거기에 넣어준다
행_복사df

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80
철민   1  남자  98   77  88  64

In [ ]:
#행 추가하기 - 단일값 추가하기
단일값_행추가df = origin.copy()
단일값_행추가df.loc['희영']=100   #모든 변수에 같은 값이 저장된다
단일값_행추가df

     학년   성별   국어   영어   수학   과학
이름
철수    1   남자   98   77   88   64
영희    2   여자   88  120   62   72
민철    1   남자   92   70   83   79
수현    3   여자   63   60   31   71
호영    4   남자   75   50   90   88
영호    4   남자   80   88   91   72
용식    2   남자   82   88   79   90
나영    1   여자   90   92   81   95
석영    1   남자   91   90   89   80
희영  100  100  100  100  100  100

### #03.행/열 추가

<열 추가>
*데이터 프레임에서 열 접근은 a[]
- 리스트로 추가하기 : 모든 행에 대한 값을 순서대로 나열, 기존 행과 개수가 다르면 에러, 빈값을 추가하려 하면 None 명시
- 딕셔너리로 추가하기 : 추가하지 않을 행은 명시하지 않으면 NaN 으로 설정된다, 기존 dataframe 에 없는 인덱스면 추가되지 않는다
- Series 객체로 추가하기 : 각 값이 연결될 행의 이름 index 를 지정해야한다, 부분적으로 값을 비워둘 수 있다
- 기존의 행을 복사해서 넣는 경우 : 각 값이 연결될 행의 이름 index 를 지정해야한다
- 단일 값 추가하기 :

In [ ]:
#열 추가하기 - 리스트로 추가하기
리스트_열추가df = origin.copy()
리스트_열추가df['한국사'] = [72,56,90,None,92,90,75,80,60] #빈값을 추가하고자 한 위치에 None 명시
리스트_열추가df

    학년  성별  국어   영어  수학  과학   한국사
이름
철수   1  남자  98   77  88  64  72.0
영희   2  여자  88  120  62  72  56.0
민철   1  남자  92   70  83  79  90.0
수현   3  여자  63   60  31  71   NaN
호영   4  남자  75   50  90  88  92.0
영호   4  남자  80   88  91  72  90.0
용식   2  남자  82   88  79  90  75.0
나영   1  여자  90   92  81  95  80.0
석영   1  남자  91   90  89  80  60.0

In [23]:
#열 추가하기 - 딕셔너리로 추가하기
딕셔너리_열추가df = origin.copy()
딕셔너리_열추가df['세계사'] = {
    "철수": 90,
    "영희": 88,
    "민철": 72,
    "수현": 56,
    "호민": 65,    #원본 df 에는 없는 익덱스이므로 추가되지 않는다
    "용식": 77,
    "나영": 95,
    "석영": 54
}

# 결과 출력
딕셔너리_열추가df

#호영, 영호는 명시되지 않아 NaN 으로 빈값이 나온다

    학년  성별  국어   영어  수학  과학   세계사
이름
철수   1  남자  98   77  88  64  90.0
영희   2  여자  88  120  62  72  88.0
민철   1  남자  92   70  83  79  72.0
수현   3  여자  63   60  31  71  56.0
호영   4  남자  75   50  90  88   NaN
영호   4  남자  80   88  91  72   NaN
용식   2  남자  82   88  79  90  77.0
나영   1  여자  90   92  81  95  95.0
석영   1  남자  91   90  89  80  54.0

In [25]:
#열 추가하기 - Series 객체로 추가하기
시리즈_열추가df = origin.copy()
s=Series([72,56,90,88] , index =['철수','민철','호영','용식'])
시리즈_열추가df['윤리'] = s
시리즈_열추가df

    학년  성별  국어   영어  수학  과학    윤리
이름
철수   1  남자  98   77  88  64  72.0
영희   2  여자  88  120  62  72   NaN
민철   1  남자  92   70  83  79  56.0
수현   3  여자  63   60  31  71   NaN
호영   4  남자  75   50  90  88  90.0
영호   4  남자  80   88  91  72   NaN
용식   2  남자  82   88  79  90  88.0
나영   1  여자  90   92  81  95   NaN
석영   1  남자  91   90  89  80   NaN

In [27]:
#열 추가하기 - 기존의 열을 복사해서 추가하는 경우
열_복사df = origin.copy()
열_복사df['체육'] = 열_복사df['과학']
열_복사df

    학년  성별  국어   영어  수학  과학  체육
이름
철수   1  남자  98   77  88  64  64
영희   2  여자  88  120  62  72  72
민철   1  남자  92   70  83  79  79
수현   3  여자  63   60  31  71  71
호영   4  남자  75   50  90  88  88
영호   4  남자  80   88  91  72  72
용식   2  남자  82   88  79  90  90
나영   1  여자  90   92  81  95  95
석영   1  남자  91   90  89  80  80

In [28]:
# 열 추가하기 - 단일 값 추가하기
단일_값추가df = origin.copy()
단일_값추가df['체육'] = 100
단일_값추가df

    학년  성별  국어   영어  수학  과학   체육
이름
철수   1  남자  98   77  88  64  100
영희   2  여자  88  120  62  72  100
민철   1  남자  92   70  83  79  100
수현   3  여자  63   60  31  71  100
호영   4  남자  75   50  90  88  100
영호   4  남자  80   88  91  72  100
용식   2  남자  82   88  79  90  100
나영   1  여자  90   92  81  95  100
석영   1  남자  91   90  89  80  100

### #04.행열 삭제하기

<행 삭제>
- 단일 행 삭제
- 다중 행 삭제
- index 에 대한 인덱싱으로 행 삭제
- index 에 대한 슬라이싱으로 행 삭제

In [30]:
# 1) 행 삭제 - 단일 행 삭제
행_삭제df = origin.copy()
행_삭제df = 행_삭제df.drop(index = '철수')
행_삭제df

    학년  성별  국어   영어  수학  과학
이름
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80

In [34]:
# 2) 행 삭제 - 다중 행 삭제
다중_삭제df = origin.copy()
다중_삭제결과df = 다중_삭제df.drop(index = ['철수','민철','수현'])
다중_삭제결과df

    학년  성별  국어   영어  수학  과학
이름
영희   2  여자  88  120  62  72
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80

In [36]:
# 3) index 에 대한 익덱싱으로 행 삭제
인덱싱_행_삭제df = origin.copy()
인덱싱_행_삭제df.index

Index(['철수', '영희', '민철', '수현', '호영', '영호', '용식', '나영', '석영'], dtype='object', name='이름')

In [38]:
인덱싱_행_삭제결과df = 인덱싱_행_삭제df.drop(index = 인덱싱_행_삭제df.index[0])
인덱싱_행_삭제결과df   # index[0] 자리가 사라짐

    학년  성별  국어   영어  수학  과학
이름
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80

In [40]:
# 4) index 에 대한 슬라이싱으로 행 삭제
다중_행_삭제df = origin.copy()
print(다중_행_삭제df.index)

Index(['철수', '영희', '민철', '수현', '호영', '영호', '용식', '나영', '석영'], dtype='object', name='이름')

In [41]:
다중_행_삭제결과df = 다중_행_삭제df.drop(index = 다중_행_삭제df.index[0:7]) #인덱싱 0-6 자리 삭제
다중_행_삭제결과df

    학년  성별  국어  영어  수학  과학
이름
나영   1  여자  90  92  81  95
석영   1  남자  91  90  89  80

<열 삭제>
- 단일 열 삭제
- 다중 열 삭제
- 컬럼명에 대한 인덱싱으로 행 삭제
- 컬럼명 에 대한 슬라이싱으로 행 삭제

In [43]:
# 1) 열 삭제 - 단일 열 삭제
단일열_삭제df = origin.copy()
단일열_삭제결과df = 단일열_삭제df.drop(columns = '학년')
단일열_삭제결과df

    성별  국어   영어  수학  과학
이름
철수  남자  98   77  88  64
영희  여자  88  120  62  72
민철  남자  92   70  83  79
수현  여자  63   60  31  71
호영  남자  75   50  90  88
영호  남자  80   88  91  72
용식  남자  82   88  79  90
나영  여자  90   92  81  95
석영  남자  91   90  89  80

In [45]:
# 2) 열 삭제 - 다중 열 삭제

다중_열_삭제df = origin.copy()
다중_열_삭제결과df = 다중_열_삭제df.drop(columns=['학년','성별','과학'])
다중_열_삭제결과df

    국어   영어  수학
이름
철수  98   77  88
영희  88  120  62
민철  92   70  83
수현  63   60  31
호영  75   50  90
영호  80   88  91
용식  82   88  79
나영  90   92  81
석영  91   90  89

In [ ]:
# 3) 열 삭제 - 컬럼 명에 대한 인덱싱으로 열 삭제

인덱싱_열_삭제df = origin.copy()
print(인덱싱_열_삭제df.columns)

Index(['학년', '성별', '국어', '영어', '수학', '과학'], dtype='object')

In [49]:
인덱싱_열_삭제결과df = 인덱싱_열_삭제df.drop(columns=인덱싱_열_삭제df.columns[0])
인덱싱_열_삭제결과df

    성별  국어   영어  수학  과학
이름
철수  남자  98   77  88  64
영희  여자  88  120  62  72
민철  남자  92   70  83  79
수현  여자  63   60  31  71
호영  남자  75   50  90  88
영호  남자  80   88  91  72
용식  남자  82   88  79  90
나영  여자  90   92  81  95
석영  남자  91   90  89  80

In [51]:
# 4) 열 삭제 - 컬럼 명에 대한 슬라이싱으로 열 삭제

다중_열_삭제df = origin.copy()
print(다중_열_삭제df.columns)

Index(['학년', '성별', '국어', '영어', '수학', '과학'], dtype='object')

In [52]:
다중_열_삭제결과df = 다중_열_삭제df.drop(columns = 다중_열_삭제df.columns[1:-2])
다중_열_삭제결과df

    학년  수학  과학
이름
철수   1  88  64
영희   2  62  72
민철   1  83  79
수현   3  31  71
호영   4  90  88
영호   4  91  72
용식   2  79  90
나영   1  81  95
석영   1  89  80

컬럼을 재배치하면서 동시에 불필요한걸 지우는 역할

행 추가
1) 리스트,
2) 딕셔너리로 넣으면 순서는 ㄱㅊ


시리즈 객체를 만들어주고,,,, 인덱스 넣어주고...




시리즈 형태일때만 빈값넣을 수 있음


데이터 프레임은 열 우선
행이면 .loc 이라 써줘야해

원본에 없는 값은 버리고, 인덱스 지정 업스면 지운다

딕셔너리일때는 갯수, 순서 신경쓸게 덜함





반복문으로 지웜버릴수도있따
리스트처럼